app/controllers/students_controller.rb

    def show
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create
        @student = Student.new(student_params(:first_name, :last_name))
        @student.save
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-03-22 22:03:08.884898"], ["updated_at", "2021-03-22 22:03:08.884898"]]

    def edit
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE (7) LIMIT ?  [["LIMIT", 1]]

    def update
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE (3) LIMIT ?  [["LIMIT", 1]]